/*Задача 1
на вход число проверяет кратно ли оно одновременно 7 и 23
-проверка сразу и 7 и 23
-найти число
-проверить делится на 7
-делится на 23
-вывести результат
да/нет*/

int num1 = 21


/*Задача 2
на вход координаты точки х и y причем х не равен 0 и y не равен 0 и выдает номер координатной четверти плоскости в которой находится та точка.
-4 четверти
-если х и н положитьельные 1 четверть
-xy отрицательные 3 четверть 
-x положит y отриц 4 четверть

/*Задача3
Принимает на вход целое число из отрезка [10,99] и показвыыает наибольшую цифрц числа
-обработать все двузначные числа
-двойной амперсант 2 условия

/*Задача4
Напишите программу которая принимает натуральное число N а на выходе показывает его цифры через запятую
-больше 0


